ws-asahi/WazamonoCore/megaavr/variants/WazamonoTachi/pins_arduino.h
/* pins_arduino.h - Variant definition for the Wazamono Tachi (AVR64DU32)
 * ---------------------------------------------------------------------------
 * Part of WazamonoCore (a product-specific fork of SpenceKonde/DxCore).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : Wazamono Tachi  (Pro Micro form factor, AVR64DU32, USB-C, Grove)
 * MCU     : AVR64DU32  (32-pin TQFP/VQFN)
 * Clock   : external 24 MHz crystal on PA0/PA1 (XTALHF1/XTALHF2)
 *           -> boards.txt must select an external-HF-crystal clock option, so
 *              CLOCK_SOURCE & 0x03 == 1 and PA0/PA1 are removed from the GPIO map.
 *           -> USB CLK_USB (48 MHz) is still produced by OSCHF + PLL48M and is
 *              auto-tuned to the USB SOF, independently of this crystal.
 *
 *  ===== Pin numbering: Pro Micro compatible (NONCANONICAL) =====
 *   D#   MCU   Pro Micro role / notes
 *   D0   PD7   RX  (Serial1 / USART1 RX, ALT2)      A30, AIN7
 *   D1   PD6   TX  (Serial1 / USART1 TX, ALT2)      A31, AIN6
 *   D2   PA2   SDA (Grove I2C) | Serial0 TX (ALT2)  A32, AIN22
 *   D3   PA3   SCL (Grove I2C) | Serial0 RX (ALT2) | ~PWM(TCB1)  A33, AIN23
 *   D4   PA7   ~AC0 OUT | (hardware SPI SS)         A6,  AIN27
 *   D5   PF0   ~PWM(TCA0 WO0)                       A34, AIN16
 *   D6   PF1   ~PWM(TCA0 WO1)                       A7,  AIN17
 *   D7   PF2   ~PWM(TCA0 WO2)                       A35, AIN18
 *   D8   PF3   ~PWM(TCA0 WO3)                       A8,  AIN19
 *   D9   PF4   ~PWM(TCA0 WO4)                       A9,  AIN20
 *   D10  PF5   ~PWM(TCA0 WO5)                       A10, AIN21
 *   D11..D13   (do not exist - gap, like the 32U4 Pro Micro)
 *   D14  PA5   MISO                                 A36, AIN25
 *   D15  PA6   SCK                                  A37, AIN26
 *   D16  PA4   MOSI                                 A38, AIN24
 *   D17  PD5   RX LED + LED_BUILTIN (on-board, no header)   AIN5
 *   D18  PD0   A0                                   AIN0
 *   D19  PD1   A1                                   AIN1
 *   D20  PD2   A2                                   AIN2
 *   D21  PD3   A3                                   AIN3
 *   D22..D29   (do not exist - gap)
 *   D30  PD4   TX LED (on-board, no header)         AIN4
 *   --- not on the Pro Micro header (appended so the arrays are complete) ---
 *        PC3   VBUS detect (VUSB power domain)      AIN31   index 31
 *        PA0   XTALHF1 (24 MHz crystal)             index 32  (NOT_A_PIN)
 *        PA1   XTALHF2 (24 MHz crystal)             index 33  (NOT_A_PIN)
 *        PF6   RESET                                index 34
 *        PF7   UPDI                                 index 35  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTF (WO0..WO5 = PF0..PF5 = D5..D10)   : TCA0_PINS below
 *   TCB1  -> PA3 (D3) default position               : ~PWM on D3
 *   millis-> TCB0  : boards.txt MUST pass -DMILLIS_USE_TIMERB0 so TCB1 is free for D3 PWM
 *   SPI0  -> default (PA4/PA5/PA6/PA7). Hardware SS (PA7) shared with D4/AC0 OUT;
 *           board is SPI host, so chip-selects are user GPIO (auto-SS not used).
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = the Grove connector.
 *   USART1-> Serial1, ALT2 (PD6 TX / PD7 RX) = D1/D0. (Only usable USART1 position.)
 *   USART0-> Serial2, ALT2 (PA2 TX / PA3 RX) = D2/D3.  <-- shares pins with Grove I2C,
 *           so Serial2 and Wire are mutually exclusive (use one or the other).
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: in DxCore USART0 is "Serial0" and USART1 is "Serial1".
 *   USART1 on the Pro Micro header pins D0/D1 is therefore Serial1 (matching the
 *   classic Pro Micro). The extra UART on D2/D3 (USART0) is exposed to users as
 *   Serial2 (ascending board convention); Serial0 remains as its internal alias.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Informational pinout tags. DU_32PIN_PINOUT keeps DU-32 feature assumptions in
 * the core; WAZAMONO_TACHI_PINOUT identifies this board. NONCANONICAL_PIN_NUMBERS
 * tells the core to derive (port,bit) from the tables below instead of assuming
 * pin number == port order (our numbering does not follow port order). */
#define DU_32PIN_PINOUT
#define WAZAMONO_TACHI_PINOUT
#define WAZAMONO_BOARD_TACHI 1  /* Board identification macro (matches bootloader convention) */
#define NONCANONICAL_PIN_NUMBERS

         /*##  ### #   #  ###
          #   #  #  ##  # #
          ####   #  # # #  ###
          #      #  #  ##     #
          #     ### #   #  # */
/* Digital pin number for each MCU pin (Pro Micro layout). */
#define PIN_PD7 (0)   // D0  RX  (USART1 RX)
#define PIN_PD6 (1)   // D1  TX  (USART1 TX)
#define PIN_PA2 (2)   // D2  SDA / Serial0 TX
#define PIN_PA3 (3)   // D3  SCL / Serial0 RX / TCB1 PWM
#define PIN_PA7 (4)   // D4  AC0 OUT / SPI SS
#define PIN_PF0 (5)   // D5  TCA0 WO0
#define PIN_PF1 (6)   // D6  TCA0 WO1
#define PIN_PF2 (7)   // D7  TCA0 WO2
#define PIN_PF3 (8)   // D8  TCA0 WO3
#define PIN_PF4 (9)   // D9  TCA0 WO4
#define PIN_PF5 (10)  // D10 TCA0 WO5
//  no  D11..D13               (gap)
#define PIN_PA5 (14)  // D14 MISO
#define PIN_PA6 (15)  // D15 SCK
#define PIN_PA4 (16)  // D16 MOSI
#define PIN_PD5 (17)  // D17 RX LED + LED_BUILTIN
#define PIN_PD0 (18)  // D18 A0
#define PIN_PD1 (19)  // D19 A1
#define PIN_PD2 (20)  // D20 A2
#define PIN_PD3 (21)  // D21 A3
//  no  D22..D29               (gap)
#define PIN_PD4 (30)  // D30 TX LED
#define PIN_PC3 (31)  // VBUS detect (not on header)
#define PIN_PA0 (32)  // XTALHF1 (crystal)
#define PIN_PA1 (33)  // XTALHF2 (crystal)
#define PIN_PF6 (34)  // RESET
#define PIN_PF7 (35)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 36)

         /*##   ##   ###  ###  ###  ###
          #   # #  # #      #  #    #
          ####  ####  ###   #  #     ###
          #   # #  #     #  #  #        #
          ####  #  # ####  ###  ###  # */
#define PINS_COUNT                     (36)  // length of the pin tables (incl. gaps/reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 36
// NUM_INTERNALLY_USED_PINS           -> auto = 2 (external crystal: PA0, PA1)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD5)   // D17, RX LED (active-LOW on board)
#endif
#define LED_BUILTIN_RX                 (PIN_PD5)   // D17 RX LED  (Pro Micro convention)
#define LED_BUILTIN_TX                 (PIN_PD4)   // D30 TX LED  (Pro Micro convention)

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

         /*   #  ###   ### ####   ###   ###
          ## ## #   # #    #   # #   # #
          # # # ##### #    ####  #   #  ###
          #   # #   # #    # #   #   #     #
          #   # #   #  ### #  #   ###   ## */
/* Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used). */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PF4 ? 20 : (p) == PIN_PF5 ? 21 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 20 ? PIN_PF4 : (p) == 21 ? PIN_PF5 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

