ws-asahi/WazamonoCore/megaavr/variants/WazamonoTachi/pins_arduino.h
/* --- Uno R4 style number-prefixed digital pin aliases (header pins only) ---
 * D-number == Arduino digital pin number. Internal-only pins (PC3 VBUS-detect,
 * PA0/PA1 crystal, PF6 RESET, PF7 UPDI) are intentionally NOT exposed as Dn.
 * #undef guards clear any stray macro definitions, matching the Uno R4 pattern. */
#undef D0
#undef D1
#undef D2
#undef D3
#undef D4
#undef D5
#undef D6
#undef D7
#undef D8
#undef D9
#undef D10
#undef D14
#undef D15
#undef D16
#undef D17
#undef D18
#undef D19
#undef D20
#undef D21
#undef D30
static const uint8_t D0  = PIN_PD7;  // RX
static const uint8_t D1  = PIN_PD6;  // TX
static const uint8_t D2  = PIN_PA2;  // SDA
static const uint8_t D3  = PIN_PA3;  // SCL
static const uint8_t D4  = PIN_PA7;  // SPI SS / AC0 OUT
static const uint8_t D5  = PIN_PF0;
static const uint8_t D6  = PIN_PF1;
static const uint8_t D7  = PIN_PF2;
static const uint8_t D8  = PIN_PF3;
static const uint8_t D9  = PIN_PF4;
static const uint8_t D10 = PIN_PF5;
static const uint8_t D14 = PIN_PA5;  // MISO
static const uint8_t D15 = PIN_PA6;  // SCK
static const uint8_t D16 = PIN_PA4;  // MOSI
static const uint8_t D17 = PIN_PD5;  // RX LED / LED_BUILTIN (on-board only, no header pin)
static const uint8_t D18 = PIN_PD0;  // A0
static const uint8_t D19 = PIN_PD1;  // A1
static const uint8_t D20 = PIN_PD2;  // A2
static const uint8_t D21 = PIN_PD3;  // A3
static const uint8_t D30 = PIN_PD4;  // TX LED (on-board only, no header pin)

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A6   = PIN_A6;
static const uint8_t A7   = PIN_A7;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;
static const uint8_t A30  = PIN_A30;
static const uint8_t A31  = PIN_A31;
static const uint8_t A32  = PIN_A32;
static const uint8_t A33  = PIN_A33;
static const uint8_t A34  = PIN_A34;
static const uint8_t A35  = PIN_A35;
static const uint8_t A36  = PIN_A36;
static const uint8_t A37  = PIN_A37;
static const uint8_t A38  = PIN_A38;

/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN0   ADC_CH(0)
#define AIN1   ADC_CH(1)
#define AIN2   ADC_CH(2)
#define AIN3   ADC_CH(3)
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN16  ADC_CH(16)
#define AIN17  ADC_CH(17)
#define AIN18  ADC_CH(18)
#define AIN19  ADC_CH(19)
#define AIN20  ADC_CH(20)
#define AIN21  ADC_CH(21)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

         /*##  ### #   #      ###  ####  ####   ###  #   #  ###
          #   #  #  ##  #     #   # #   # #   # #   #  # #  #
          ####   #  # # #     ##### ####  ####  #####   #    ###
          #      #  #  ##     #   # #  #  #  #  #   #   #       #
          #     ### #   #     #   # #   # #   # #   #   #    # */
#ifdef ARDUINO_MAIN
  // Indexed by digital pin number (0..35). Gaps and USB pins are NOT_A_PORT.
  const uint8_t digital_pin_to_port[] = {
    PD,         //  0 PD7  RX/USART1 RX
    PD,         //  1 PD6  TX/USART1 TX
    PA,         //  2 PA2  SDA/Serial0 TX
    PA,         //  3 PA3  SCL/Serial0 RX/TCB1
    PA,         //  4 PA7  AC0 OUT/SS
    PF,         //  5 PF0  TCA0 WO0
    PF,         //  6 PF1  TCA0 WO1
    PF,         //  7 PF2  TCA0 WO2
    PF,         //  8 PF3  TCA0 WO3
    PF,         //  9 PF4  TCA0 WO4
    PF,         // 10 PF5  TCA0 WO5
    NOT_A_PORT, // 11 (gap)
    NOT_A_PORT, // 12 (gap)
    NOT_A_PORT, // 13 (gap)
    PA,         // 14 PA5  MISO
    PA,         // 15 PA6  SCK
    PA,         // 16 PA4  MOSI
    PD,         // 17 PD5  RX LED / LED_BUILTIN
    PD,         // 18 PD0  A0
    PD,         // 19 PD1  A1
    PD,         // 20 PD2  A2
    PD,         // 21 PD3  A3
    NOT_A_PORT, // 22 (gap)
    NOT_A_PORT, // 23 (gap)
    NOT_A_PORT, // 24 (gap)
    NOT_A_PORT, // 25 (gap)
    NOT_A_PORT, // 26 (gap)
    NOT_A_PORT, // 27 (gap)
    NOT_A_PORT, // 28 (gap)
    NOT_A_PORT, // 29 (gap)
    PD,         // 30 PD4  TX LED
    PC,         // 31 PC3  VBUS detect
    PA,         // 32 PA0  XTALHF1
    PA,         // 33 PA1  XTALHF2
    PF,         // 34 PF6  RESET
    PF          // 35 PF7  UPDI
  };

  /* Bit position within the port (for PINnCTRL access). */
  const uint8_t digital_pin_to_bit_position[] = {
    PIN7_bp,   //  0 PD7
    PIN6_bp,   //  1 PD6
    PIN2_bp,   //  2 PA2
    PIN3_bp,   //  3 PA3
    PIN7_bp,   //  4 PA7
    PIN0_bp,   //  5 PF0
    PIN1_bp,   //  6 PF1
    PIN2_bp,   //  7 PF2
    PIN3_bp,   //  8 PF3
    PIN4_bp,   //  9 PF4
    PIN5_bp,   // 10 PF5
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bp,   // 14 PA5
    PIN6_bp,   // 15 PA6
    PIN4_bp,   // 16 PA4
    PIN5_bp,   // 17 PD5
    PIN0_bp,   // 18 PD0
    PIN1_bp,   // 19 PD1
    PIN2_bp,   // 20 PD2
    PIN3_bp,   // 21 PD3
    NOT_A_PIN, // 22 (gap)
    NOT_A_PIN, // 23 (gap)
    NOT_A_PIN, // 24 (gap)
    NOT_A_PIN, // 25 (gap)
    NOT_A_PIN, // 26 (gap)
    NOT_A_PIN, // 27 (gap)
    NOT_A_PIN, // 28 (gap)
    NOT_A_PIN, // 29 (gap)
    PIN4_bp,   // 30 PD4
    PIN3_bp,   // 31 PC3
    #if ((CLOCK_SOURCE & 0x03) == 0) // internal clock -> PA0 is a usable GPIO
      PIN0_bp, // 32 PA0
    #else                            // external crystal/clock -> PA0 = XTALHF1
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1) // external crystal also takes PA1
      NOT_A_PIN,
    #else
      PIN1_bp, // 33 PA1
    #endif
    PIN6_bp,   // 34 PF6 RESET
    PIN7_bp    // 35 PF7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN7_bm,   //  0 PD7
    PIN6_bm,   //  1 PD6
    PIN2_bm,   //  2 PA2
    PIN3_bm,   //  3 PA3
    PIN7_bm,   //  4 PA7
    PIN0_bm,   //  5 PF0
    PIN1_bm,   //  6 PF1
    PIN2_bm,   //  7 PF2
    PIN3_bm,   //  8 PF3
    PIN4_bm,   //  9 PF4
    PIN5_bm,   // 10 PF5
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bm,   // 14 PA5
    PIN6_bm,   // 15 PA6
    PIN4_bm,   // 16 PA4
    PIN5_bm,   // 17 PD5
    PIN0_bm,   // 18 PD0
    PIN1_bm,   // 19 PD1
    PIN2_bm,   // 20 PD2
    PIN3_bm,   // 21 PD3
    NOT_A_PIN, // 22 (gap)
    NOT_A_PIN, // 23 (gap)
    NOT_A_PIN, // 24 (gap)
    NOT_A_PIN, // 25 (gap)
    NOT_A_PIN, // 26 (gap)
    NOT_A_PIN, // 27 (gap)
    NOT_A_PIN, // 28 (gap)
    NOT_A_PIN, // 29 (gap)
    PIN4_bm,   // 30 PD4
    PIN3_bm,   // 31 PC3
    #if ((CLOCK_SOURCE & 0x03) == 0)
      PIN0_bm, // 32 PA0
    #else
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1)
      NOT_A_PIN,
    #else
      PIN1_bm, // 33 PA1
    #endif
    PIN6_bm,   // 34 PF6 RESET
    PIN7_bm    // 35 PF7 UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. Only the TCB outputs are listed (PA2=TCB0, PA3=TCB1). */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PD7
    NOT_ON_TIMER, //  1 PD6
    TIMERB0,      //  2 PA2  (TCB0 - used for millis on this board)
    TIMERB1,      //  3 PA3  (TCB1 - D3 PWM)
    NOT_ON_TIMER, //  4 PA7
    NOT_ON_TIMER, //  5 PF0  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  6 PF1  (TCA0 WO1, dynamic)
    NOT_ON_TIMER, //  7 PF2  (TCA0 WO2, dynamic)
    NOT_ON_TIMER, //  8 PF3  (TCA0 WO3, dynamic)
    NOT_ON_TIMER, //  9 PF4  (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 10 PF5  (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 11 (gap)
    NOT_ON_TIMER, // 12 (gap)
    NOT_ON_TIMER, // 13 (gap)
    NOT_ON_TIMER, // 14 PA5
    NOT_ON_TIMER, // 15 PA6
    NOT_ON_TIMER, // 16 PA4
    NOT_ON_TIMER, // 17 PD5
    NOT_ON_TIMER, // 18 PD0
    NOT_ON_TIMER, // 19 PD1
    NOT_ON_TIMER, // 20 PD2
    NOT_ON_TIMER, // 21 PD3
    NOT_ON_TIMER, // 22 (gap)
    NOT_ON_TIMER, // 23 (gap)
    NOT_ON_TIMER, // 24 (gap)
    NOT_ON_TIMER, // 25 (gap)
    NOT_ON_TIMER, // 26 (gap)
    NOT_ON_TIMER, // 27 (gap)
    NOT_ON_TIMER, // 28 (gap)
    NOT_ON_TIMER, // 29 (gap)
    NOT_ON_TIMER, // 30 PD4
    NOT_ON_TIMER, // 31 PC3
    NOT_ON_TIMER, // 32 PA0
    NOT_ON_TIMER, // 33 PA1
    NOT_ON_TIMER, // 34 PF6 RESET
    NOT_ON_TIMER  // 35 PF7 UPDI
  };
#endif

